
&НаКлиенте
Процедура ЗагрузитьФактуруАнкет(Команда)
	
	ЗагрузитьФактуруАнкетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФактуруАнкетНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыполнитьЗагрузкуФактурыАнкетКлиентов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокАнкет(Команда)
	
	ЗагрузитьСписокАнкетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокАнкетНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыполнитьЗагрузкуСпискаАнкетКлиентов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеАнкет(Команда)
	
	ЗагрузитьДанныеАнкетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеАнкетНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыполнитьЗагрузкуДанныхАнкетКлиентов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеАнкетЗаТриДня(Команда)
	
	ЗагрузитьДанныеАнкетЗаТриДняНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеАнкетЗаТриДняНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыполнитьЗагрузкуДанныхАнкетКлиентовЗаТриДня();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеАнкетЗаПериод(Команда)
	
	ВыгрузитьДанныеАнкетЗаПериодНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьДанныеАнкетЗаПериодНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыполнитьВыгрузкуДанныхАнкетКлиентовЗаПериод();
	
КонецПроцедуры
